Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.1.45/atdf/PIC32MZ0512EFK064.atdf
      <value-group caption="Crypto Engine Interrupt Pending Status bit" name="CEINTSRC__PENDIF">
         <value caption="Crypto Engine interrupt is pending (this value is the result of an OR of all interrupts in the Crypto Engine)" name="" value="0x1"/>
         <value caption="Crypto Engine interrupt is not pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="BD Transmit Status bit" name="CEINTSRC__CBDIF">
         <value caption="Last BD transmit was processed" name="" value="0x1"/>
         <value caption="Last BD transmit has not been processed" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Packet Completion Interrupt Status bit" name="CEINTSRC__PKTIF">
         <value caption="DMA packet was completed" name="" value="0x1"/>
         <value caption="DMA packet was not completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Access Response Error Interrupt bit" name="CEINTSRC__AREIF">
         <value caption="Error occurred trying to access memory outside the Crypto Engine" name="" value="0x1"/>
         <value caption="No error has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Master Interrupt Enable bit" name="CEINTEN__PENDIE">
         <value caption="Crypto Engine interrupts are enabled" name="" value="0x1"/>
         <value caption="Crypto Engine interrupts are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Buffer Descriptor Processor Interrupt Enable bit" name="CEINTEN__BDPIE">
         <value caption="BDP interrupts are enabled" name="" value="0x1"/>
         <value caption="BDP interrupts are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Packet Completion Interrupt Enable bit" name="CEINTEN__PKTIE">
         <value caption="DMA packet completion interrupts are enabled" name="" value="0x1"/>
         <value caption="DMA packet completion interrupts are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Access Response Error Interrupt Enable bit" name="CEINTEN__AREIE">
         <value caption="Access response error interrupts are enabled" name="" value="0x1"/>
         <value caption="Access response error interrupts are not enabled" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="00800" name="CVR" version="1">
      <register-group name="CVR">
         <register caption="Comparator Voltage Reference Control Register" name="CVRCON" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CVR"/>
            <bitfield caption="CVref Source Selection bit" mask="0x00000010" name="CVRSS" values="CVRCON__CVRSS"/>
            <bitfield caption="CVref Range Selection bit" mask="0x00000020" name="CVRR" values="CVRCON__CVRR"/>
            <bitfield caption="CVrefout Enable bit" mask="0x00000040" name="CVROE" values="CVRCON__CVROE"/>
            <bitfield mask="0x00000300" name="BGSEL"/>
            <bitfield mask="0x00000400" name="VREFSEL"/>
            <bitfield caption="Comparator Voltage Reference On bit" mask="0x00008000" name="ON" values="CVRCON__ON"/>
         </register>
      </register-group>
      <value-group caption="CVref Source Selection bit" name="CVRCON__CVRSS">
         <value caption="Comparator voltage reference source, CVRSRC = (VREF+) - (VREF-)" name="" value="0x1"/>
         <value caption="Comparator voltage reference source, CVRSRC = AVDD - AVSS" name="" value="0x0"/>
      </value-group>
      <value-group caption="CVref Range Selection bit" name="CVRCON__CVRR">
         <value caption="0 to 0.67 CVrsrc" name="" value="0x1"/>
         <value caption="0.25 CVrsrc to 0.75 CVrsrc" name="" value="0x0"/>
      </value-group>
      <value-group caption="CVrefout Enable bit" name="CVRCON__CVROE">
         <value caption="Voltage level is output on CVrefout pin" name="" value="0x1"/>
         <value caption="Voltage level is disconnected from CVrefout pin" name="" value="0x0"/>
      </value-group>
      <value-group caption="Comparator Voltage Reference On bit" name="CVRCON__ON">
         <value caption="Module is enabled. Setting this bit does not affect other bits in the register." name="" value="0x1"/>
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in the register." name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="01500" name="DMAC" version="2">
      <register-group name="DMAC">
         <register caption="DMA Controller Control Register" name="DMACON" offset="0x0" rw="RW" size="4">
            <bitfield caption="DMA Module Busy bit" mask="0x00000800" name="DMABUSY" values="DMACON__DMABUSY"/>
            <bitfield caption="DMA Suspend bit" mask="0x00001000" name="SUSPEND" values="DMACON__SUSPEND"/>
            <bitfield caption="DMA On bit" mask="0x00010000" name="ON" values="DMACON__ON"/>
         </register>
         <register caption="DMA Status Register" name="DMASTAT" offset="0x10" rw="R" size="4">
            <bitfield mask="0x00000007" name="DMACH"/>
            <bitfield caption="Read/Write Status bit" mask="0x80000000" name="RDWR" values="DMASTAT__RDWR"/>
         </register>
         <register caption="DMA Address Register" name="DMAADDR" offset="0x20" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR"/>
         </register>
         <register caption="DMA CRC Control Register" name="DCRCCON" offset="0x30" rw="RW" size="4">
            <bitfield caption="CRC Channel Select bits" mask="0x00000007" name="CRCCH" values="DCRCCON__CRCCH"/>
            <bitfield caption="CRC Type Selection bit" mask="0x00000020" name="CRCTYP" values="DCRCCON__CRCTYP"/>
            <bitfield caption="CRC Append Mode bit" mask="0x00000040" name="CRCAPP" values="DCRCCON__CRCAPP"/>
            <bitfield caption="CRC Enable bit" mask="0x00000080" name="CRCEN" values="DCRCCON__CRCEN"/>
            <bitfield caption="Polynomial Length bits" mask="0x00001F00" name="PLEN" values="DCRCCON__PLEN"/>
            <bitfield caption="CRC Bit Order Selection bit" mask="0x01000000" name="BITO" values="DCRCCON__BITO"/>
            <bitfield caption="CRC Write Byte Order Selection bit" mask="0x08000000" name="WBO" values="DCRCCON__WBO"/>
            <bitfield caption="CRC Byte Order Selection bits" mask="0x30000000" name="BYTO" values="DCRCCON__BYTO"/>
         </register>
         <register caption="DMA CRC Data Register" name="DCRCDATA" offset="0x40" rw="RW" size="4">
            <bitfield caption="CRC Data Register bits" mask="0xFFFFFFFF" name="DCRCDATA" values="DCRCDATA__DCRCDATA"/>
         </register>
         <register caption="DMA CRCXOR Enable Register" name="DCRCXOR" offset="0x50" rw="RW" size="4">
            <bitfield caption="CRC XOR Register bits" mask="0xFFFFFFFF" name="DCRCXOR" values="DCRCXOR__DCRCXOR"/>
         </register>
