Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.1.45/atdf/PIC32MZ0512EFK064.atdf
         <register caption="Change Notice control for PORTx Register" name="CNCONB" offset="0x70" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONB__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONB__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONC" offset="0x170" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONC__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONC__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCOND" offset="0x270" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCOND__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCOND__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONE" offset="0x370" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONE__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONE__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONF" offset="0x470" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONF__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONF__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONG" offset="0x570" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONG__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONG__ON"/>
         </register>
         <register caption="" name="CNENB" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENB0"/>
            <bitfield mask="0x00000002" name="CNENB1"/>
            <bitfield mask="0x00000004" name="CNENB2"/>
            <bitfield mask="0x00000008" name="CNENB3"/>
            <bitfield mask="0x00000010" name="CNENB4"/>
            <bitfield mask="0x00000020" name="CNENB5"/>
            <bitfield mask="0x00000040" name="CNENB6"/>
            <bitfield mask="0x00000080" name="CNENB7"/>
            <bitfield mask="0x00000100" name="CNENB8"/>
            <bitfield mask="0x00000200" name="CNENB9"/>
            <bitfield mask="0x00000400" name="CNENB10"/>
            <bitfield mask="0x00000800" name="CNENB11"/>
            <bitfield mask="0x00001000" name="CNENB12"/>
            <bitfield mask="0x00002000" name="CNENB13"/>
            <bitfield mask="0x00004000" name="CNENB14"/>
            <bitfield mask="0x00008000" name="CNENB15"/>
         </register>
         <register caption="" name="CNENC" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENC0"/>
            <bitfield mask="0x00000002" name="CNENC1"/>
            <bitfield mask="0x00000004" name="CNENC2"/>
            <bitfield mask="0x00000008" name="CNENC3"/>
            <bitfield mask="0x00000010" name="CNENC4"/>
            <bitfield mask="0x00000020" name="CNENC5"/>
            <bitfield mask="0x00000040" name="CNENC6"/>
            <bitfield mask="0x00000080" name="CNENC7"/>
            <bitfield mask="0x00000100" name="CNENC8"/>
            <bitfield mask="0x00000200" name="CNENC9"/>
            <bitfield mask="0x00000400" name="CNENC10"/>
            <bitfield mask="0x00000800" name="CNENC11"/>
            <bitfield mask="0x00001000" name="CNENC12"/>
            <bitfield mask="0x00002000" name="CNENC13"/>
            <bitfield mask="0x00004000" name="CNENC14"/>
            <bitfield mask="0x00008000" name="CNENC15"/>
         </register>
         <register caption="" name="CNEND" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNEND0"/>
            <bitfield mask="0x00000002" name="CNEND1"/>
            <bitfield mask="0x00000004" name="CNEND2"/>
            <bitfield mask="0x00000008" name="CNEND3"/>
            <bitfield mask="0x00000010" name="CNEND4"/>
            <bitfield mask="0x00000020" name="CNEND5"/>
            <bitfield mask="0x00000040" name="CNEND6"/>
            <bitfield mask="0x00000080" name="CNEND7"/>
            <bitfield mask="0x00000100" name="CNEND8"/>
            <bitfield mask="0x00000200" name="CNEND9"/>
            <bitfield mask="0x00000400" name="CNEND10"/>
            <bitfield mask="0x00000800" name="CNEND11"/>
            <bitfield mask="0x00001000" name="CNEND12"/>
            <bitfield mask="0x00002000" name="CNEND13"/>
            <bitfield mask="0x00004000" name="CNEND14"/>
            <bitfield mask="0x00008000" name="CNEND15"/>
         </register>
         <register caption="" name="CNENE" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENE0"/>
            <bitfield mask="0x00000002" name="CNENE1"/>
            <bitfield mask="0x00000004" name="CNENE2"/>
            <bitfield mask="0x00000008" name="CNENE3"/>
            <bitfield mask="0x00000010" name="CNENE4"/>
            <bitfield mask="0x00000020" name="CNENE5"/>
            <bitfield mask="0x00000040" name="CNENE6"/>
            <bitfield mask="0x00000080" name="CNENE7"/>
            <bitfield mask="0x00000100" name="CNENE8"/>
            <bitfield mask="0x00000200" name="CNENE9"/>
            <bitfield mask="0x00000400" name="CNENE10"/>
            <bitfield mask="0x00000800" name="CNENE11"/>
            <bitfield mask="0x00001000" name="CNENE12"/>
            <bitfield mask="0x00002000" name="CNENE13"/>
            <bitfield mask="0x00004000" name="CNENE14"/>
            <bitfield mask="0x00008000" name="CNENE15"/>
         </register>
         <register caption="" name="CNENF" offset="0x480" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENF0"/>
            <bitfield mask="0x00000002" name="CNENF1"/>
            <bitfield mask="0x00000004" name="CNENF2"/>
            <bitfield mask="0x00000008" name="CNENF3"/>
            <bitfield mask="0x00000010" name="CNENF4"/>
            <bitfield mask="0x00000020" name="CNENF5"/>
            <bitfield mask="0x00000040" name="CNENF6"/>
            <bitfield mask="0x00000080" name="CNENF7"/>
            <bitfield mask="0x00000100" name="CNENF8"/>
            <bitfield mask="0x00000200" name="CNENF9"/>
            <bitfield mask="0x00000400" name="CNENF10"/>
            <bitfield mask="0x00000800" name="CNENF11"/>
            <bitfield mask="0x00001000" name="CNENF12"/>
            <bitfield mask="0x00002000" name="CNENF13"/>
            <bitfield mask="0x00004000" name="CNENF14"/>
            <bitfield mask="0x00008000" name="CNENF15"/>
         </register>
         <register caption="" name="CNENG" offset="0x580" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENG0"/>
            <bitfield mask="0x00000002" name="CNENG1"/>
            <bitfield mask="0x00000004" name="CNENG2"/>
            <bitfield mask="0x00000008" name="CNENG3"/>
            <bitfield mask="0x00000010" name="CNENG4"/>
            <bitfield mask="0x00000020" name="CNENG5"/>
            <bitfield mask="0x00000040" name="CNENG6"/>
            <bitfield mask="0x00000080" name="CNENG7"/>
            <bitfield mask="0x00000100" name="CNENG8"/>
            <bitfield mask="0x00000200" name="CNENG9"/>
            <bitfield mask="0x00000400" name="CNENG10"/>
            <bitfield mask="0x00000800" name="CNENG11"/>
            <bitfield mask="0x00001000" name="CNENG12"/>
            <bitfield mask="0x00002000" name="CNENG13"/>
            <bitfield mask="0x00004000" name="CNENG14"/>
            <bitfield mask="0x00008000" name="CNENG15"/>
         </register>
