Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.1.45/atdf/PIC32MZ0512EFK064.atdf
         <register caption="" name="CNSTATB" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATB0"/>
            <bitfield mask="0x00000002" name="CNSTATB1"/>
            <bitfield mask="0x00000004" name="CNSTATB2"/>
            <bitfield mask="0x00000008" name="CNSTATB3"/>
            <bitfield mask="0x00000010" name="CNSTATB4"/>
            <bitfield mask="0x00000020" name="CNSTATB5"/>
            <bitfield mask="0x00000040" name="CNSTATB6"/>
            <bitfield mask="0x00000080" name="CNSTATB7"/>
            <bitfield mask="0x00000100" name="CNSTATB8"/>
            <bitfield mask="0x00000200" name="CNSTATB9"/>
            <bitfield mask="0x00000400" name="CNSTATB10"/>
            <bitfield mask="0x00000800" name="CNSTATB11"/>
            <bitfield mask="0x00001000" name="CNSTATB12"/>
            <bitfield mask="0x00002000" name="CNSTATB13"/>
            <bitfield mask="0x00004000" name="CNSTATB14"/>
            <bitfield mask="0x00008000" name="CNSTATB15"/>
         </register>
         <register caption="" name="CNSTATC" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATC0"/>
            <bitfield mask="0x00000002" name="CNSTATC1"/>
            <bitfield mask="0x00000004" name="CNSTATC2"/>
            <bitfield mask="0x00000008" name="CNSTATC3"/>
            <bitfield mask="0x00000010" name="CNSTATC4"/>
            <bitfield mask="0x00000020" name="CNSTATC5"/>
            <bitfield mask="0x00000040" name="CNSTATC6"/>
            <bitfield mask="0x00000080" name="CNSTATC7"/>
            <bitfield mask="0x00000100" name="CNSTATC8"/>
            <bitfield mask="0x00000200" name="CNSTATC9"/>
            <bitfield mask="0x00000400" name="CNSTATC10"/>
            <bitfield mask="0x00000800" name="CNSTATC11"/>
            <bitfield mask="0x00001000" name="CNSTATC12"/>
            <bitfield mask="0x00002000" name="CNSTATC13"/>
            <bitfield mask="0x00004000" name="CNSTATC14"/>
            <bitfield mask="0x00008000" name="CNSTATC15"/>
         </register>
         <register caption="" name="CNSTATD" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATD0"/>
            <bitfield mask="0x00000002" name="CNSTATD1"/>
            <bitfield mask="0x00000004" name="CNSTATD2"/>
            <bitfield mask="0x00000008" name="CNSTATD3"/>
            <bitfield mask="0x00000010" name="CNSTATD4"/>
            <bitfield mask="0x00000020" name="CNSTATD5"/>
            <bitfield mask="0x00000040" name="CNSTATD6"/>
            <bitfield mask="0x00000080" name="CNSTATD7"/>
            <bitfield mask="0x00000100" name="CNSTATD8"/>
            <bitfield mask="0x00000200" name="CNSTATD9"/>
            <bitfield mask="0x00000400" name="CNSTATD10"/>
            <bitfield mask="0x00000800" name="CNSTATD11"/>
            <bitfield mask="0x00001000" name="CNSTATD12"/>
            <bitfield mask="0x00002000" name="CNSTATD13"/>
            <bitfield mask="0x00004000" name="CNSTATD14"/>
            <bitfield mask="0x00008000" name="CNSTATD15"/>
         </register>
         <register caption="" name="CNSTATE" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATE0"/>
            <bitfield mask="0x00000002" name="CNSTATE1"/>
            <bitfield mask="0x00000004" name="CNSTATE2"/>
            <bitfield mask="0x00000008" name="CNSTATE3"/>
            <bitfield mask="0x00000010" name="CNSTATE4"/>
            <bitfield mask="0x00000020" name="CNSTATE5"/>
            <bitfield mask="0x00000040" name="CNSTATE6"/>
            <bitfield mask="0x00000080" name="CNSTATE7"/>
            <bitfield mask="0x00000100" name="CNSTATE8"/>
            <bitfield mask="0x00000200" name="CNSTATE9"/>
            <bitfield mask="0x00000400" name="CNSTATE10"/>
            <bitfield mask="0x00000800" name="CNSTATE11"/>
            <bitfield mask="0x00001000" name="CNSTATE12"/>
            <bitfield mask="0x00002000" name="CNSTATE13"/>
            <bitfield mask="0x00004000" name="CNSTATE14"/>
            <bitfield mask="0x00008000" name="CNSTATE15"/>
         </register>
         <register caption="" name="CNSTATF" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATF0"/>
            <bitfield mask="0x00000002" name="CNSTATF1"/>
            <bitfield mask="0x00000004" name="CNSTATF2"/>
            <bitfield mask="0x00000008" name="CNSTATF3"/>
            <bitfield mask="0x00000010" name="CNSTATF4"/>
            <bitfield mask="0x00000020" name="CNSTATF5"/>
            <bitfield mask="0x00000040" name="CNSTATF6"/>
            <bitfield mask="0x00000080" name="CNSTATF7"/>
            <bitfield mask="0x00000100" name="CNSTATF8"/>
            <bitfield mask="0x00000200" name="CNSTATF9"/>
            <bitfield mask="0x00000400" name="CNSTATF10"/>
            <bitfield mask="0x00000800" name="CNSTATF11"/>
            <bitfield mask="0x00001000" name="CNSTATF12"/>
            <bitfield mask="0x00002000" name="CNSTATF13"/>
            <bitfield mask="0x00004000" name="CNSTATF14"/>
            <bitfield mask="0x00008000" name="CNSTATF15"/>
         </register>
         <register caption="" name="CNSTATG" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATG0"/>
            <bitfield mask="0x00000002" name="CNSTATG1"/>
            <bitfield mask="0x00000004" name="CNSTATG2"/>
            <bitfield mask="0x00000008" name="CNSTATG3"/>
            <bitfield mask="0x00000010" name="CNSTATG4"/>
            <bitfield mask="0x00000020" name="CNSTATG5"/>
            <bitfield mask="0x00000040" name="CNSTATG6"/>
            <bitfield mask="0x00000080" name="CNSTATG7"/>
            <bitfield mask="0x00000100" name="CNSTATG8"/>
            <bitfield mask="0x00000200" name="CNSTATG9"/>
            <bitfield mask="0x00000400" name="CNSTATG10"/>
            <bitfield mask="0x00000800" name="CNSTATG11"/>
            <bitfield mask="0x00001000" name="CNSTATG12"/>
            <bitfield mask="0x00002000" name="CNSTATG13"/>
            <bitfield mask="0x00004000" name="CNSTATG14"/>
            <bitfield mask="0x00008000" name="CNSTATG15"/>
         </register>
         <register caption="" name="CNNEB" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEB0"/>
            <bitfield mask="0x00000002" name="CNNEB1"/>
            <bitfield mask="0x00000004" name="CNNEB2"/>
            <bitfield mask="0x00000008" name="CNNEB3"/>
            <bitfield mask="0x00000010" name="CNNEB4"/>
            <bitfield mask="0x00000020" name="CNNEB5"/>
            <bitfield mask="0x00000040" name="CNNEB6"/>
            <bitfield mask="0x00000080" name="CNNEB7"/>
            <bitfield mask="0x00000100" name="CNNEB8"/>
            <bitfield mask="0x00000200" name="CNNEB9"/>
            <bitfield mask="0x00000400" name="CNNEB10"/>
            <bitfield mask="0x00000800" name="CNNEB11"/>
            <bitfield mask="0x00001000" name="CNNEB12"/>
            <bitfield mask="0x00002000" name="CNNEB13"/>
            <bitfield mask="0x00004000" name="CNNEB14"/>
            <bitfield mask="0x00008000" name="CNNEB15"/>
         </register>
         <register caption="" name="CNNEC" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEC0"/>
            <bitfield mask="0x00000002" name="CNNEC1"/>
            <bitfield mask="0x00000004" name="CNNEC2"/>
            <bitfield mask="0x00000008" name="CNNEC3"/>
            <bitfield mask="0x00000010" name="CNNEC4"/>
            <bitfield mask="0x00000020" name="CNNEC5"/>
            <bitfield mask="0x00000040" name="CNNEC6"/>
            <bitfield mask="0x00000080" name="CNNEC7"/>
            <bitfield mask="0x00000100" name="CNNEC8"/>
            <bitfield mask="0x00000200" name="CNNEC9"/>
            <bitfield mask="0x00000400" name="CNNEC10"/>
            <bitfield mask="0x00000800" name="CNNEC11"/>
            <bitfield mask="0x00001000" name="CNNEC12"/>
            <bitfield mask="0x00002000" name="CNNEC13"/>
            <bitfield mask="0x00004000" name="CNNEC14"/>
            <bitfield mask="0x00008000" name="CNNEC15"/>
         </register>
         <register caption="" name="CNNED" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNED0"/>
            <bitfield mask="0x00000002" name="CNNED1"/>
            <bitfield mask="0x00000004" name="CNNED2"/>
            <bitfield mask="0x00000008" name="CNNED3"/>
            <bitfield mask="0x00000010" name="CNNED4"/>
            <bitfield mask="0x00000020" name="CNNED5"/>
            <bitfield mask="0x00000040" name="CNNED6"/>
            <bitfield mask="0x00000080" name="CNNED7"/>
            <bitfield mask="0x00000100" name="CNNED8"/>
            <bitfield mask="0x00000200" name="CNNED9"/>
            <bitfield mask="0x00000400" name="CNNED10"/>
            <bitfield mask="0x00000800" name="CNNED11"/>
            <bitfield mask="0x00001000" name="CNNED12"/>
            <bitfield mask="0x00002000" name="CNNED13"/>
            <bitfield mask="0x00004000" name="CNNED14"/>
            <bitfield mask="0x00008000" name="CNNED15"/>
         </register>
         <register caption="" name="CNNEE" offset="0x3a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEE0"/>
            <bitfield mask="0x00000002" name="CNNEE1"/>
            <bitfield mask="0x00000004" name="CNNEE2"/>
            <bitfield mask="0x00000008" name="CNNEE3"/>
            <bitfield mask="0x00000010" name="CNNEE4"/>
            <bitfield mask="0x00000020" name="CNNEE5"/>
            <bitfield mask="0x00000040" name="CNNEE6"/>
            <bitfield mask="0x00000080" name="CNNEE7"/>
            <bitfield mask="0x00000100" name="CNNEE8"/>
            <bitfield mask="0x00000200" name="CNNEE9"/>
            <bitfield mask="0x00000400" name="CNNEE10"/>
            <bitfield mask="0x00000800" name="CNNEE11"/>
            <bitfield mask="0x00001000" name="CNNEE12"/>
            <bitfield mask="0x00002000" name="CNNEE13"/>
            <bitfield mask="0x00004000" name="CNNEE14"/>
            <bitfield mask="0x00008000" name="CNNEE15"/>
         </register>
