Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.1.45/atdf/PIC32MZ0512EFK064.atdf
         <register caption="" name="SBT2RD2" offset="0x8380" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2RD2__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2RD2__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2RD2__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2RD2__GROUP3"/>
         </register>
         <register caption="" name="SBT3RD0" offset="0x8740" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3RD0__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3RD0__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3RD0__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3RD0__GROUP3"/>
         </register>
         <register caption="" name="SBT3RD1" offset="0x8760" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3RD1__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3RD1__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3RD1__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3RD1__GROUP3"/>
         </register>
         <register caption="" name="SBT3RD2" offset="0x8780" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3RD2__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3RD2__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3RD2__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3RD2__GROUP3"/>
         </register>
         <register caption="" name="SBT4RD0" offset="0x8b40" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT4RD0__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT4RD0__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT4RD0__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT4RD0__GROUP3"/>
         </register>
         <register caption="" name="SBT4RD2" offset="0x8b80" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT4RD2__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT4RD2__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT4RD2__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT4RD2__GROUP3"/>
         </register>
         <register caption="" name="SBT5RD0" offset="0x8f40" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT5RD0__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT5RD0__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT5RD0__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT5RD0__GROUP3"/>
         </register>
         <register caption="" name="SBT5RD1" offset="0x8f60" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT5RD1__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT5RD1__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT5RD1__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT5RD1__GROUP3"/>
         </register>
         <register caption="" name="SBT5RD2" offset="0x8f80" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT5RD2__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT5RD2__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT5RD2__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT5RD2__GROUP3"/>
         </register>
         <register caption="" name="SBT6RD0" offset="0x9340" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT6RD0__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT6RD0__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT6RD0__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT6RD0__GROUP3"/>
         </register>
         <register caption="" name="SBT6RD1" offset="0x9360" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT6RD1__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT6RD1__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT6RD1__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT6RD1__GROUP3"/>
         </register>
         <register caption="" name="SBT7RD0" offset="0x9740" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT7RD0__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT7RD0__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT7RD0__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT7RD0__GROUP3"/>
         </register>
         <register caption="" name="SBT7RD1" offset="0x9760" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT7RD1__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT7RD1__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT7RD1__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT7RD1__GROUP3"/>
         </register>
         <register caption="" name="SBT8RD0" offset="0x9b40" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT8RD0__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT8RD0__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT8RD0__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT8RD0__GROUP3"/>
         </register>
         <register caption="" name="SBT8RD1" offset="0x9b60" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT8RD1__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT8RD1__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT8RD1__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT8RD1__GROUP3"/>
         </register>
